# ============================================================================
# 第四章 暖冷房設備
# 第十節 ペレットストーブ
# Ver.01（エネルギー消費性能計算プログラム（住宅版）Ver.03.8～）
# ============================================================================

import numpy as np

from pyhees.section4_1_Q import get_Q_T_H_d_t_i

# ============================================================================
# 5. 最大暖房能力
# ============================================================================

def get_Q_max_H_d_t(q_max_H):
    """日付dの時刻tにおける1時間当たりの最大暖房出力(1)
    
    Args:
        q_max_H (float): 最大暖房能力（kW）

    Returns:
        ndarray: 日付dの時刻tにおける1時間当たりの最大暖房出力（MJ/h）
    """

    Q_max_H = q_max_H * 3600 * 10 ** -3
    Q_max_H_d_t = Q_max_H * np.ones(24 * 365)
    
    return Q_max_H_d_t


def calc_Q_UT_H_d_t(L_H_d_t, q_max_H):
    """未処理暖房負荷

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）第三章「暖冷房負荷と外皮性能」第一節「全般」により定まる。
        q_max_H(float):最大暖房能力（kW）

    Returns:
        ndarray: 未処理暖房負荷

    """

    # 最大暖房出力
    Q_max_H_d_t = get_Q_max_H_d_t(q_max_H)

    # 処理暖房負荷
    Q_T_H_d_t = get_Q_T_H_d_t_i(Q_max_H_d_t, L_H_d_t)
    
    # 未処理暖房負荷
    Q_UT_H_d_t = L_H_d_t - Q_T_H_d_t

    return Q_UT_H_d_t


# ============================================================================
# 6. 暖房エネルギー消費量
# ============================================================================

# ============================================================================
# 6.1 消費電力量
# ============================================================================

def calc_E_E_H_d_t(L_H_d_t, E_E_ign_d_t, P_cmb):
    """日付dの時刻tにおける１時間当たりの消費電力量を算出する関数(2)

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）
        E_E_ign_d_t (ndarray): 点火時消費電力量（Wh）
        P_cmb (float): 定常時消費電力（W）
    Returns:
        ndarray: 日付dの時刻tにおける1時間当たりの消費電力量（kWh/h）
    """
    
    # 日付dの時刻tにおける1時間当たりの点火回数（回/h）を取得
    n_ing_d_t = calc_n_ign_d_t(L_H_d_t)
    
    # 日付dの時刻tにおける1時間当たりの燃焼時間数（h/h）を取得
    tau_cmb_d_t = calc_tau_cmb_d_t(L_H_d_t)
    
    # 日付dの時刻tにおける1時間当たりの消費電力量（kWh/h）を取得
    E_E_H_d_t = get_E_E_H_d_t(E_E_ign_d_t, n_ing_d_t, P_cmb, tau_cmb_d_t)
    
    return E_E_H_d_t

def get_E_E_H_d_t(E_E_ign_d_t, n_ing_d_t, P_cmb, tau_cmb_d_t):
    """日付dの時刻tにおける1時間当たりの燃焼時間数を取得する関数(2)

    Args:
        E_E_ign_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）
        n_ing_d_t (ndarray): 日付dの時刻tにおける1時間当たりの点火回数（回/h）
        P_cmb (float): 定常時消費電力（W）
        tau_cmb_d_t (ndarray): 日付dの時刻tにおける1時間当たりの燃焼時間数（h/h）

    Returns:
        ndarray: 日付dの時刻tにおける1時間当たりの燃焼時間数（h/h）
    """
    E_E_H_d_t = E_E_ign_d_t * n_ing_d_t * 10 ** -3 + P_cmb * tau_cmb_d_t * 10 ** -3
    return E_E_H_d_t

def calc_tau_cmb_d_t(L_H_d_t):
    """日付dの時刻tにおける1時間当たりの燃焼時間数を算出する関数(3)

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）

    Returns:
        ndarray: 日付dの時刻tにおける1時間当たりの燃焼時間数（h/h）
    """
    
    # 計算タイムステップ（h）を取得
    delta_t_calc = get_delta_t_calc()

    tau_cmb_d_t = np.where(
        L_H_d_t == 0.0, 
        0.0,            # L_H_d_t = 0
        delta_t_calc    # L_H_d_t != 0
    )
    
    return tau_cmb_d_t
    

def calc_n_ign_d_t(L_H_d_t):
    """日付dの時刻tにおける1時間当たりの点火回数を算出する関数(4)

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）

    Returns:
        ndarray: 日付dの時刻tにおける1時間当たりの点火回数（回/h）
    """
    
    t = np.array(range(24))
    d_t = np.tile(t, 365)
    
    # 日付dにおける点火時刻(-)を取得
    t_ign_d = get_t_ign_d(L_H_d_t)
    
    n_ign_d_t = np.zeros_like(d_t)
    for i, _t in enumerate(d_t):
        _d = i // 24
        # 時刻が点火時刻の集合に含まれる場合は 1
        # 含まれない場合は 0
        n_ign_d_t[i] = 1 if _t in t_ign_d[_d] else 0
    
    return n_ign_d_t

def get_t_ign_d(L_H_d_t):
    """日付dにおける点火時刻を取得する関数(5)

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）

    Returns:
        list[set[int]]: 日付dにおける点火時刻(-)
    """
    
    f1 = np.roll(L_H_d_t, shift=1) == 0  # L_H_d_h-1 = 0
    f2 = L_H_d_t > 0                     # L_H_d_h_ > 0
    f3 = np.logical_and(f1, f2)
    f3 = np.reshape(f3, (365, 24))
    
    t_ign_d = [
        # 時刻の集合として取り出す
        set(
            # 条件を満たす時刻を取得
            np.where(
                f3[row,:]
            )[0]
        ) 
        for row in range(f3.shape[0])
    ]
    
    return t_ign_d

    
# ============================================================================
# 6.2 ガス消費量
# ============================================================================

def get_E_G_H_d_t():
    """日付dの時刻tにおける１時間当たりのガス消費量を取得する関数

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりのガス消費量
    """
    return np.zeros(24 * 365)

# ============================================================================
# 6.3 灯油消費量
# ============================================================================
def get_E_K_H_d_t():
    """日付dの時刻tにおける１時間当たりの灯油消費量を取得する関数

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりの灯油消費量
    """
    return np.zeros(24 * 365)

# ============================================================================
# 6.4 木質燃料消費量
# ============================================================================
def calc_E_WF_H_d_t(L_H_d_t, q_max_H, e_rtd_H):
    """日付dの時刻tにおける１時間当たりの木質燃料消費量を取得する関数

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）
        q_max_H (float): 最大暖房能力（kW）
        e_rtd_H (float): 定格熱効率（%）

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりの木質燃料消費量
    """
    return calc_E_F_H_d_t(L_H_d_t, q_max_H, e_rtd_H) 

# ============================================================================
# 6.5 その他の燃料による一次エネルギー消費量
# ============================================================================
def get_E_M_H_d_t():
    """日付dの時刻tにおける１時間当たりのその他の燃料による一次エネルギー消費量を取得する関数

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりのその他の燃料による一次エネルギー消費量
    """
    return np.zeros(24 * 365)

# ============================================================================
# 7. 燃料消費量
# ============================================================================
def calc_E_F_H_d_t(L_H_d_t, q_max_H, e_rtd_H):
    """日付dの時刻tにおける１時間当たりの燃料消費量を算出する関数(6)

    Args:
        L_H_d_t (ndarray): 日付dの時刻tにおける1時間当たりの暖房負荷（MJ/h）
        q_max_H (float): 最大暖房能力（kW）
        e_rtd_H (float): 定格熱効率（%）

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりの燃料消費量（MJ/h）
    """

    # 最大暖房出力
    Q_max_H_d_t = get_Q_max_H_d_t(q_max_H)

    # 処理暖房負荷
    Q_T_H_d_t = get_Q_T_H_d_t_i(Q_max_H_d_t, L_H_d_t)
    
    # 燃料消費量
    E_F_H_d_t = get_E_F_H_d_t(Q_T_H_d_t, e_rtd_H)

    return E_F_H_d_t

def get_E_F_H_d_t(Q_T_H_d_t, e_rtd_H):
    """日付dの時刻tにおける１時間当たりの燃料消費量を取得する関数

    Args:
        Q_T_H_d_t (ndarray_type_): 日付dの時刻tにおける１時間当たりの処理暖房負荷（MJ/h）
        e_rtd_H (float): 定格熱効率（%）

    Returns:
        ndarray: 日付dの時刻tにおける１時間当たりの燃料消費量（MJ/h）
    """

    E_F_H_d_t = Q_T_H_d_t / (e_rtd_H * 10 ** -2)
    return E_F_H_d_t

# ============================================================================
# 10. 計算タイムステップ
# ============================================================================
def get_delta_t_calc():
    """計算タイムステップを取得する関数

    Returns:
        float: 計算タイムステップ(h)
    """
    return 1.0